package ru.alexander_kramarenko.refactoring_project;

// Почему разделены два интерфейса
// Movable и Stoppable
// По принципу SOLID большие интерфейсы разбиваем на куски
// Но разбивать два метода на два интерфейса, ради разбиения
// смысла нет

// Подключение к машине по отдельности не несет смысла
// Получается, что машина может не запускаться и всегда останавливаться
// или она может всегда запускаться и не останавливаться

// Их объединение не даст большого эффекта, т.к. у нас есть
// только одна машина и ничего более.
// Эти методы можно разместить в Car

public interface Moveable {

    void move();

}
